erpdev.СХК_Расширение/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ce59e7d4-ce32-4e73-8b06-cda594aec2b3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f624df26-f68d-4892-b33d-cf2ef3cdaa0c">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="987ffccd-246d-49b8-a223-e53d76678887">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="861931ca-dadf-424e-9e87-cc6fec41bf47">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/CommonModules/__СпОбщийМодуль/Module.bsl
//++ plotnikov@syspod.ru #84483
Функция  ЗаполнитьБанковскийСчет(Контрагент) Экспорт
	
	БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Контрагенты.Ссылка КАК Ссылка1,
	                      |	КонтрагентыДополнительныеРеквизиты.Свойство КАК Свойство,
	                      |	КонтрагентыДополнительныеРеквизиты.Значение КАК Значение,
	                      |	КонтрагентыДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул КАК СвойствоИдентификаторДляФормул
	                      |ИЗ
	                      |	Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	                      |		ПО КонтрагентыДополнительныеРеквизиты.Ссылка = Контрагенты.Ссылка
	                      |ГДЕ
	                      |	Контрагенты.Ссылка = &Ссылка
	                      |	И КонтрагентыДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = &ИдентификаторДляФормул");
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Запрос.УстановитьПараметр("ИдентификаторДляФормул", "БанковскийСчетДляЗаказов");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		БанковскийСчет = Выборка.Значение;
	КонецЦикла;
	Возврат БанковскийСчет;
КонецФункции
//-- plotnikov@syspod.ru #84483 

//++ plotnikov@syspod.ru #84786
Функция ОтредактироватьКоличествоЕдиницПоУсловию(Количество, Кэф, Номенклатура) Экспорт
		
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ЦБ-00006863"));
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ЦБ-00009031"));
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ЦБ-00009034"));
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ЦБ-00007066"));
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ЦБ-00009032"));
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ЦБ-00009089"));
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ЦБ-00008801"));
	
	КоличествоЕдиниц = 0;
	
	Если Кэф = 0 Тогда
		КоличествоЕдиниц = Количество * 1;
	Иначе
		Если МассивНоменклатуры.Найти(Номенклатура) <> Неопределено  Тогда
			КоличествоЕдиниц = Количество * 1;
		Иначе
			КоличествоЕдиниц =Количество * Кэф;
		КонецЕсли;
	КонецЕсли;
	Возврат КоличествоЕдиниц;
КонецФункции
//-- plotnikov@syspod.ru #84786
